English/SSLD/3-3 3.16 Expression - Facts.org
#+OPTIONS: \n:t toc:nil num:nil html-postamble:nil
#+HTML_HEAD_EXTRA: <style>body {background: rgb(193, 230, 198) !important;}</style>
* 3-3 3.16 Expression - Facts
#+begin_verse
In this section we will be talking about expression.
Expression, just like reception, is a very important component of communication.
I'm wondering if you want to start
	by talking about facts and how can we present facts in the best possible manner?
	
Well, I'm almost feeling very nervous now as I have to answer this question.
Because the entire business of academia and maybe education
	is about how we present certain facts effectively.
And I'm not sure when I'm answering your question.
I'm not sure.
Are we doing this right, even, ourselves?
What I can say is that there is obviously a whole scholarship on how can we present facts better.
At the university, we have specialists
	who are helping our graduate students and undergrad students write better
		so that they present facts and ideas better.
And in some disciplines in the sciences
	they have really organized structures for people to present things.
What you did in the experiment, what happened?
What are the results?
How do you analyze the data?
So we have actually very well-established protocols for presenting facts.
And in some disciplines like management schools or in law,
	people are trained to present facts in a certain way
		in order to achieve whatever objective they have.
If you were presenting facts in a court, in an adversarial situation,
	versus you're presenting facts to your client as a lawyer, well, you do it differently.
So we're probably not going to get into details in those.

What we may want to be focusing on is when we're in an interpersonal situation,
	when we're trying to develop a relationship, how we are going to present facts.
And what facts should we be presenting?
I think the important thing here of course is to look at the purpose of our engagement.
Are we trying to build friendship here?
Or are we trying to start a romantic relationship here?
Or are we trying to sell something [LAUGH]?
Or am I trying to resolve conflict?
The kind of facts that you are trying to present
	is always contingent upon the purpose of the engagement.
	
So what do you plan to accomplish?
And then effective communication is based on a good understanding of your partner
	or the person that you're interacting with.
What are this person's N3C?
If you know the person's needs, circumstances, characteristics and capacity,
	then it will be like selecting presentation of facts according.
And I think that's the general principle.
Say for example, if I know that you really have pent-up emotions that you need to be letting out.
Presenting facts that would further provoke you [LAUGH].
[LAUGH] Obviously would not help, right?
So I would be presenting facts that would make it easier for you
	to have an alternate construction of reality and reframe your situation.
And give you maybe the perfect excuse to share some of your feelings.

Let me give you an example.
If I'm talking to someone about being bullied at work.
And you have a lot of pent-up feelings.
I have a range of options to select, to tell you facts about.
I can tell you that you know what, 60% of women working in Canada have experienced that.
That is one set of facts, right?
And if I tell you that well, people who utilize services within the system to address it,
	like harassment offices or HR departments, or talking to a union representative who can help you.
That is another kind of fact that I can present to you.
If I find that you're very interested in talking about the personality of the bullier,
	then I can say, well,
		people who bully are usually people
			with poor self-image and inadequate social skills themselves.
And those people who generally do not even have good mental health.
And I understand that by sharing this with you it is not how accurate the facts are that matters.
It is to give you an opportunity to express your emotions in the way
	that you feel comfortable with.
All right?

So that is, I think, the key idea now, when we're talking about what facts are we communicating.
And then we do not obviously rule out
	that in some situations all you need would be simple, straightforward facts.
Like, I'm going to Japan, [LAUGH] I'm going to Kyoto,
	do you know hotels that are clean, convenient, and affordable?
Then I can be responding to it in a more matter of fact manner.
Expression of facts depends on the purpose of engagement,
	whether you are trying to build a friendship or establishing a romantic relationship.
You should also have a good understanding of your partner's N3C,
		their needs, circumstances, characteristics, and capacity,
	in order to communicate effectively.
If you've forgotten what N3C stands for, please check out module one, lecture 1.6.
#+end_verse
** expression
component [kəmˈpoʊnənt]: n. one of several parts that together make up a whole machine, system etc SYN constituent组成部分
academia [ˌækəˈdimiə]: n. the activities and work done at universities and colleges, or the teachers and students involved in it学术界
scholarship [ˈskɑlərˌʃɪp]: n. the knowledge, work, or methods involved in serious studying学问
specialist [ˈspeʃ(ə)lɪst]: n. someone who knows a lot about a particular subject, or is very skilled at it SYN expert专家
discipline [ˈdɪsəplɪn]: n. an area of knowledge or teaching, especially one such as history, chemistry, mathematics etc that is studied at a university学科
structure [ˈstrʌktʃər]: n. the way in which the parts of something are connected with each other and form a whole, or the thing that these parts make up ⇨ structural结构
analyze [ˈæn(ə)lˌaɪz] analyse: v. to examine or think about something carefully, in order to understand it分析
protocol [ˈproʊtəˌkɔl]: n. a system of rules about the correct way to behave on an official occasion协议
adversarial [ˌædvɜrˈseriəl]: adj. an adversarial system, especially in politics and the law, is one in which two sides oppose and attack each other对抗(性)的
resolve [rɪˈzɑlv]: v. to find a satisfactory way of dealing with a problem or difficulty SYN solve ⇨ settle解决
pent-up [ˌpen-up]: adj. pent-up feelings or energy have not been expressed or used for a long time被压抑的
provoke [prəˈvoʊk]: v. to cause a reaction or feeling, especially a sudden one ⇨ provocation煽动
bully [ˈbʊli] bullier: v.n. someone who uses their strength or power to frighten or hurt someone who is weaker霸凌
harassment [həˈræsmənt]: n. when someone behaves in an unpleasant or threatening way towards you骚扰
personality [ˌpɜrsəˈnæləti]: n. someone’s character, especially the way they behave towards other people个性
--------------------
graduate students: 研究生
undergrad students: 本科生
be contingent upon sth.: 取决于某事物
a range of sth.: 一系列某事物
rule out that + ...: 排除掉+...
stand for sth./sb.: 代表某人/某事
