SSLD/3-3 3.16 Expression - Facts.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-12-09 Mon 14:41 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="author" content="DESKTOP-13B7HQM" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<div id="outline-container-org5382603" class="outline-2">
<h2 id="org5382603">3-3 3.16 Expression - Facts</h2>
<div class="outline-text-2" id="text-org5382603">
<p class="verse">
In this section we will be talking about expression.<br />
Expression, just like reception, is a very important component of communication.<br />
I'm wondering if you want to start<br />
&#xa0;by talking about facts and how can we present facts in the best possible manner?<br />
<br />
Well, I'm almost feeling very nervous now as I have to answer this question.<br />
Because the entire business of academia and maybe education<br />
&#xa0;is about how we present certain facts effectively.<br />
And I'm not sure when I'm answering your question.<br />
I'm not sure.<br />
Are we doing this right, even, ourselves?<br />
What I can say is that there is obviously a whole scholarship on how can we present facts better.<br />
At the university, we have specialists<br />
&#xa0;who are helping our graduate students and undergrad students write better<br />
&#xa0;&#xa0;so that they present facts and ideas better.<br />
And in some disciplines in the sciences<br />
&#xa0;they have really organized structures for people to present things.<br />
What you did in the experiment, what happened?<br />
What are the results?<br />
How do you analyze the data?<br />
So we have actually very well-established protocols for presenting facts.<br />
And in some disciplines like management schools or in law,<br />
&#xa0;people are trained to present facts in a certain way<br />
&#xa0;&#xa0;in order to achieve whatever objective they have.<br />
If you were presenting facts in a court, in an adversarial situation,<br />
&#xa0;versus you're presenting facts to your client as a lawyer, well, you do it differently.<br />
So we're probably not going to get into details in those.<br />
<br />
What we may want to be focusing on is when we're in an interpersonal situation,<br />
&#xa0;when we're trying to develop a relationship, how we are going to present facts.<br />
And what facts should we be presenting?<br />
I think the important thing here of course is to look at the purpose of our engagement.<br />
Are we trying to build friendship here?<br />
Or are we trying to start a romantic relationship here?<br />
Or are we trying to sell something [LAUGH]?<br />
Or am I trying to resolve conflict?<br />
The kind of facts that you are trying to present<br />
&#xa0;is always contingent upon the purpose of the engagement.<br />
<br />
So what do you plan to accomplish?<br />
And then effective communication is based on a good understanding of your partner<br />
&#xa0;or the person that you're interacting with.<br />
What are this person's N3C?<br />
If you know the person's needs, circumstances, characteristics and capacity,<br />
&#xa0;then it will be like selecting presentation of facts according.<br />
And I think that's the general principle.<br />
Say for example, if I know that you really have pent-up emotions that you need to be letting out.<br />
Presenting facts that would further provoke you [LAUGH].<br />
[LAUGH] Obviously would not help, right?<br />
So I would be presenting facts that would make it easier for you<br />
&#xa0;to have an alternate construction of reality and reframe your situation.<br />
And give you maybe the perfect excuse to share some of your feelings.<br />
<br />
Let me give you an example.<br />
If I'm talking to someone about being bullied at work.<br />
And you have a lot of pent-up feelings.<br />
I have a range of options to select, to tell you facts about.<br />
I can tell you that you know what, 60% of women working in Canada have experienced that.<br />
That is one set of facts, right?<br />
And if I tell you that well, people who utilize services within the system to address it,<br />
&#xa0;like harassment offices or HR departments, or talking to a union representative who can help you.<br />
That is another kind of fact that I can present to you.<br />
If I find that you're very interested in talking about the personality of the bullier,<br />
&#xa0;then I can say, well,<br />
&#xa0;&#xa0;people who bully are usually people<br />
&#xa0;&#xa0;&#xa0;with poor self-image and inadequate social skills themselves.<br />
And those people who generally do not even have good mental health.<br />
And I understand that by sharing this with you it is not how accurate the facts are that matters.<br />
It is to give you an opportunity to express your emotions in the way<br />
&#xa0;that you feel comfortable with.<br />
All right?<br />
<br />
So that is, I think, the key idea now, when we're talking about what facts are we communicating.<br />
And then we do not obviously rule out<br />
&#xa0;that in some situations all you need would be simple, straightforward facts.<br />
Like, I'm going to Japan, [LAUGH] I'm going to Kyoto,<br />
&#xa0;do you know hotels that are clean, convenient, and affordable?<br />
Then I can be responding to it in a more matter of fact manner.<br />
Expression of facts depends on the purpose of engagement,<br />
&#xa0;whether you are trying to build a friendship or establishing a romantic relationship.<br />
You should also have a good understanding of your partner's N3C,<br />
&#xa0;&#xa0;their needs, circumstances, characteristics, and capacity,<br />
&#xa0;in order to communicate effectively.<br />
If you've forgotten what N3C stands for, please check out module one, lecture 1.6.<br />
</p>
</div>
<div id="outline-container-org466cee5" class="outline-3">
<h3 id="org466cee5">expression</h3>
<div class="outline-text-3" id="text-org466cee5">
<p>
component [kəmˈpoʊnənt]: n. one of several parts that together make up a whole machine, system etc SYN constituent组成部分<br />
academia [ˌækəˈdimiə]: n. the activities and work done at universities and colleges, or the teachers and students involved in it学术界<br />
scholarship [ˈskɑlərˌʃɪp]: n. the knowledge, work, or methods involved in serious studying学问<br />
specialist [ˈspeʃ(ə)lɪst]: n. someone who knows a lot about a particular subject, or is very skilled at it SYN expert专家<br />
discipline [ˈdɪsəplɪn]: n. an area of knowledge or teaching, especially one such as history, chemistry, mathematics etc that is studied at a university学科<br />
structure [ˈstrʌktʃər]: n. the way in which the parts of something are connected with each other and form a whole, or the thing that these parts make up ⇨ structural结构<br />
analyze [ˈæn(ə)lˌaɪz] analyse: v. to examine or think about something carefully, in order to understand it分析<br />
protocol [ˈproʊtəˌkɔl]: n. a system of rules about the correct way to behave on an official occasion协议<br />
adversarial [ˌædvɜrˈseriəl]: adj. an adversarial system, especially in politics and the law, is one in which two sides oppose and attack each other对抗(性)的<br />
resolve [rɪˈzɑlv]: v. to find a satisfactory way of dealing with a problem or difficulty SYN solve ⇨ settle解决<br />
pent-up [ˌpen-up]: adj. pent-up feelings or energy have not been expressed or used for a long time被压抑的<br />
provoke [prəˈvoʊk]: v. to cause a reaction or feeling, especially a sudden one ⇨ provocation煽动<br />
bully [ˈbʊli] bullier: v.n. someone who uses their strength or power to frighten or hurt someone who is weaker霸凌<br />
harassment [həˈræsmənt]: n. when someone behaves in an unpleasant or threatening way towards you骚扰<br />
personality [ˌpɜrsəˈnæləti]: n. someone’s character, especially the way they behave towards other people个性<br />
</p>
<hr />
<p>
graduate students: 研究生<br />
undergrad students: 本科生<br />
be contingent upon sth.: 取决于某事物<br />
a range of sth.: 一系列某事物<br />
rule out that + &#x2026;: 排除掉+&#x2026;<br />
stand for sth./sb.: 代表某人/某事<br />
</p>
</div>
</div>
