SSLD/3-3 3.16 Expression - Facts.html
<div id="outline-container-org8472bdd" class="outline-3">
<h3 id="org8472bdd">sentence</h3>
<div class="outline-text-3" id="text-org8472bdd">
<p>
component [kəmˈpoʊnənt]: n. one of several parts that together make up a whole machine, system etc SYN constituent组成部分<br />
</p>
<ul class="org-ul">
<li>Exercise is one of key component of being expert at English.<br /></li>
<li>These robots are one of key component of the factory.<br /></li>
<li>Missing key component of the machine, we can't use it to detect gold in the cave.<br /></li>
</ul>
<p>
academia [ˌækəˈdimiə]: n. the activities and work done at universities and colleges, or the teachers and students involved in it学术界<br />
</p>
<ul class="org-ul">
<li>She has been trained to counsel a king in academia for many years.<br /></li>
<li>There is a piece of breaking news in academia.<br /></li>
<li>The scandal in academia was revealed after a journalist had published an article about it in the press.<br /></li>
</ul>
<p>
scholarship [ˈskɑlərˌʃɪp]: n. the knowledge, work, or methods involved in serious studying学问<br />
</p>
<ul class="org-ul">
<li>Few of us in seat couldn't publish a piece of scholarship for the rest of your life.<br /></li>
<li>His lifetime of scholarship may end because of being accused of sex harassment.<br /></li>
<li>The murder he committed in public brought an end to his lifetime of scholarship.<br /></li>
</ul>
<p>
specialist [ˈspeʃ(ə)lɪst]: n. someone who knows a lot about a particular subject, or is very skilled at it SYN expert专家<br />
</p>
<ul class="org-ul">
<li>The student is alwaysing raising issues about the subject which only specialists are able to answer.<br /></li>
<li>It's not common that an eminent specialist will come to a hospital in the district.<br /></li>
<li>As the virus spread all over the city and threatened the whole country, the specialist felt obliged to invest the cause of the epidemic.<br /></li>
</ul>
<p>
discipline [ˈdɪsəplɪn]: n. an area of knowledge or teaching, especially one such as history, chemistry, mathematics etc that is studied at a university学科<br />
</p>
<ul class="org-ul">
<li>Beyond doubt, the study of an academic discipline has changed his life.<br /></li>
<li>Consequently, the study of an academic discipline has rarely been utilized in industry.<br /></li>
<li>The study of this academic discipline gave way to its utilization in industry.<br /></li>
</ul>
<p>
structure [ˈstrʌktʃər]: n. the way in which the parts of something are connected with each other and form a whole, or the thing that these parts make up ⇨ structural结构<br />
</p>
<ul class="org-ul">
<li>As long as the new programmer is acquinted with the structure of the project, I will leave our company.<br /></li>
<li>Not acquinted with the structure of the project, the programmer often ran into trouble while coding.<br /></li>
<li>If you were familiar with the structure of the machine, you would make such stupid remarks.<br /></li>
</ul>
<p>
analyze [ˈæn(ə)lˌaɪz] analyse: v. to examine or think about something carefully, in order to understand it分析<br />
</p>
<ul class="org-ul">
<li>There is a wonderful tool to analyze the statistics, but we lacks its licence and may take legel risks.<br /></li>
<li>His method to analyze the statistics of sales became popular with people in the company, so he was promoted by his superior.<br /></li>
<li>Failing to analyze the statistics, our CEO decided to gamble.<br /></li>
</ul>
<p>
protocol [ˈproʊtəˌkɔl]: n. a system of rules about the correct way to behave on an official occasion协议<br />
</p>
<ul class="org-ul">
<li>The protocol is made up of two objects and a set of rules.<br /></li>
<li>The internet protocol is designed to transfer files between two computers.<br /></li>
<li>Disobeying the protocol, you can't be connected to your partner.<br /></li>
</ul>
<p>
adversarial [ˌædvɜrˈseriəl]: adj. an adversarial system, especially in politics and the law, is one in which two sides oppose and attack each other对抗(性)的<br />
</p>
<ul class="org-ul">
<li>Winners take all in an adversarial game.<br /></li>
<li>In the adversarial game, he behaved very bravely and was admired by poor and rich alike.<br /></li>
<li>In the adversarial game, he behaved as a coward and was abused by his fans.<br /></li>
</ul>
<p>
resolve [rɪˈzɑlv]: v. to find a satisfactory way of dealing with a problem or difficulty SYN solve ⇨ settle解决<br />
</p>
<ul class="org-ul">
<li>Because of lack of social interaction skills, he was reluctant to resolve conflicts between his inferiors.<br /></li>
<li>I appreciate that you help resolve the conflict between me and my colleague.<br /></li>
<li>The specialist has been trained to resolve conflict in reltionships for many years.<br /></li>
</ul>
<p>
pent-up [ˌpen-up]: adj. pent-up feelings or energy have not been expressed or used for a long time被压抑的<br />
</p>
<ul class="org-ul">
<li>Follow your heart and let your pent-up emotions out.<br /></li>
<li>He is not capable to express his pent-up emotions to his wife.<br /></li>
<li>Because the prince was killed in action, the king's pent-up emotions led him to start a war with the neighbor.<br /></li>
</ul>
<p>
provoke [prəˈvoʊk]: v. to cause a reaction or feeling, especially a sudden one ⇨ provocation激起<br />
</p>
<ul class="org-ul">
<li>Tax increase without the approval of the paliament provoked wide-spread criticism and rebellions.<br /></li>
<li>The behangings of three innocent persons provoked that people held grudge against the king.<br /></li>
<li>A piece of cake flowing across the street provoked a series of catastrophes.<br /></li>
</ul>
<p>
bully [ˈbʊli] bullier: v.n. someone who uses their strength or power to frighten or hurt someone who is weaker霸凌<br />
</p>
<ul class="org-ul">
<li>He claimed that he hadn't bullied any his teammate when he was in the team.<br /></li>
<li>The bullier was accused of robbing his teammate's gift.<br /></li>
<li>The headmaster rounded up bullier to stand trial in front of all staffs of the high school.<br /></li>
</ul>
<p>
harassment [həˈræsmənt]: n. when someone behaves in an unpleasant or threatening way towards you骚扰<br />
</p>
<ul class="org-ul">
<li>The sexual harrassment brought about the downfall of the headmaster who had devoted himself to education for nearly twenty years.<br /></li>
<li>Justice has not been done, when sexual harrassment still prevailed in office.<br /></li>
<li>The old gentleman, who was always so kind to everybody, was accused of sexual harassment in his youth.<br /></li>
</ul>
<p>
personality [ˌpɜrsəˈnæləti]: n. someone’s character, especially the way they behave towards other people个性,性格<br />
</p>
<ul class="org-ul">
<li>It is important for us to be able to figure out the personality of the person who you are trying to build relationship with.<br /></li>
<li>His warlike personality by no means makes him a great knight.<br /></li>
<li>His vulnerable personality caused him to lose his lead in his class.<br /></li>
</ul>
<hr />
<p>
graduate students: 研究生<br />
</p>
<ul class="org-ul">
<li>The so-called teacher turned out to be a graduate student.<br /></li>
<li>Our academy could not afford so many graduate students.<br /></li>
<li>The graduate student lost his temper when he learnt that he still had a difficult time finding an appropriate job.<br /></li>
</ul>
<p>
undergrad students: 本科生<br />
</p>
<ul class="org-ul">
<li>Obviously, our boss takes the undergrad student seriously.<br /></li>
<li>Nowadays, more and more undergrad students take interest in playing truant from school.<br /></li>
<li>There are increasing undergrad students who get obsessed with video games after surviving grim high schools.<br /></li>
</ul>
<p>
be contingent upon sth.: 取决于某事物<br />
</p>
<ul class="org-ul">
<li>Whether you step out of the cell is contingent upon the emotions of the king.<br /></li>
<li>Whether the watchdogs are kept in closure is contingent upon the number of visitors at the monastery.<br /></li>
<li>Whether I give you pocket money is contingent upon the money I made this year.<br /></li>
</ul>
<p>
a range of sth.: 一系列某事物<br />
</p>
<ul class="org-ul">
<li>A range of TV series made me familiar with English voices.<br /></li>
<li>A range of catastrophes made the great boxer live in poverty for the rest of his life.<br /></li>
<li>The king set up a range of laws prohibiting digging up graves.<br /></li>
</ul>
<p>
rule out that + &#x2026;: 排除掉+&#x2026;<br />
</p>
<ul class="org-ul">
<li>The visitor ruled out that he was a robot.<br /></li>
<li>My wife ruled out that our son had been kidnapped.<br /></li>
<li>The butcher ruled out that his family had been bombed in an air raid.<br /></li>
</ul>
<p>
stand for sth./sb.: 代表某人/某事<br />
</p>
<ul class="org-ul">
<li>Standing for our people, I have to do what benefit them.<br /></li>
<li>Standing for staffs in the high school, the headmaster raised up money to have the classrooms repaired.<br /></li>
<li>Standing for people in the community, I arranged the settlement with the company.<br /></li>
</ul>
</div>
</div>
